---
type: PointIterator
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 8
tags: [revit-api, class]
---

# PointIterator

`Autodesk.Revit.DB.PointClouds.PointIterator` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Free | 2012 | `public void Free ()` |
| Method | IsDone | 2012 | `public bool IsDone ()` |
| Method | MoveNext | 2012 | `public virtual bool MoveNext ()` |
| Method | Reset | 2012 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual CloudPoint Current { get ; }` |
| Property | CurrentObject | — | `public Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |